# missing data with dataframe

In [1]:
import pandas as pd
import numpy as np

In [2]:
d = {'A':[1,2,np.nan],'B':[3,np.nan,np.nan],'c':[4,5,6]}

In [3]:
d

{'A': [1, 2, nan], 'B': [3, nan, nan], 'c': [4, 5, 6]}

In [4]:
df = pd.DataFrame(d)
df

     A    B  c
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [5]:
# dropna method

df.dropna()

     A    B  c
0  1.0  3.0  4

In [8]:
df.dropna(thresh=2,axis = 1)

     A  c
0  1.0  4
1  2.0  5
2  NaN  6

In [9]:
df.dropna(thresh=1)

     A    B  c
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [10]:
df.fillna(value='New Value')

           A          B  c
0        1.0        3.0  4
1        2.0  New Value  5
2  New Value  New Value  6

In [11]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64